{"config": {"name": "model_20", "output_layers": [["dense_39", 0, 0]], "layers": [{"name": "input_23", "config": {"name": "input_23", "batch_input_shape": [null, 784], "input_dtype": "float32"}, "class_name": "InputLayer", "inbound_nodes": []}, {"name": "dense_34", "config": {"name": "dense_34", "W_constraint": null, "trainable": true, "b_constraint": null, "activity_regularizer": null, "init": "glorot_uniform", "input_dim": null, "output_dim": 128, "activation": "relu", "bias": true, "W_regularizer": null, "b_regularizer": null}, "class_name": "Dense", "inbound_nodes": [[["input_23", 0, 0]]]}, {"name": "dense_35", "config": {"name": "dense_35", "W_constraint": null, "trainable": true, "b_constraint": null, "activity_regularizer": null, "init": "glorot_uniform", "input_dim": null, "output_dim": 64, "activation": "relu", "bias": true, "W_regularizer": null, "b_regularizer": null}, "class_name": "Dense", "inbound_nodes": [[["dense_34", 0, 0]]]}, {"name": "dense_36", "config": {"name": "dense_36", "W_constraint": null, "trainable": true, "b_constraint": null, "activity_regularizer": null, "init": "glorot_uniform", "input_dim": null, "output_dim": 32, "activation": "relu", "bias": true, "W_regularizer": null, "b_regularizer": null}, "class_name": "Dense", "inbound_nodes": [[["dense_35", 0, 0]]]}, {"name": "dense_37", "config": {"name": "dense_37", "W_constraint": null, "trainable": true, "b_constraint": null, "activity_regularizer": null, "init": "glorot_uniform", "input_dim": null, "output_dim": 64, "activation": "relu", "bias": true, "W_regularizer": null, "b_regularizer": null}, "class_name": "Dense", "inbound_nodes": [[["dense_36", 0, 0]]]}, {"name": "dense_38", "config": {"name": "dense_38", "W_constraint": null, "trainable": true, "b_constraint": null, "activity_regularizer": null, "init": "glorot_uniform", "input_dim": null, "output_dim": 128, "activation": "relu", "bias": true, "W_regularizer": null, "b_regularizer": null}, "class_name": "Dense", "inbound_nodes": [[["dense_37", 0, 0]]]}, {"name": "dense_39", "config": {"name": "dense_39", "W_constraint": null, "trainable": true, "b_constraint": null, "activity_regularizer": null, "init": "glorot_uniform", "input_dim": null, "output_dim": 784, "activation": "sigmoid", "bias": true, "W_regularizer": null, "b_regularizer": null}, "class_name": "Dense", "inbound_nodes": [[["dense_38", 0, 0]]]}], "input_layers": [["input_23", 0, 0]]}, "class_name": "Model", "keras_version": "1.0.5", "loss": "binary_crossentropy", "optimizer": {"name": "Adadelta", "lr": 1.0, "rho": 0.95, "epsilon": 1e-08}, "sample_weight_mode": null, "loss_weights": null}